In [ ]:
对数据集进行分组并对各组应用一个函数（无论是聚合还是转换），通常是数据分析工作中的重要环节。
在将数据集加载、融合、准备好之后，通常就是计算分组统计或生成透视表。
pandas提供了一个灵活高效的gruopby功能，它使你能以一种自然的方式对数据集进行切片、切块、摘要等操作。

关系型数据库和SQL（Structured Query Language，结构化查询语言）能够如此流行的原因之一就是其能够方便地对数据进行连接、过滤、转换和聚合。
但是，像SQL这样的查询语言所能执行的分组运算的种类很有限。
在本章中你将会看到，由于Python和pandas强大的表达能力，我们可以执行复杂得多的分组运算（利用任何可以接受pandas对象或NumPy数组的函数）。

在本章中，你将会学到：
    
    - 使用一个或多个键（形式可以是函数、数组或DataFrame列名）分割pandas对象。
    - 计算分组的概述统计，比如数量、平均值或标准差，或是用户定义的函数。
    - 应用组内转换或其他运算，如规格化、线性回归、排名或选取子集等。
    - 计算透视表或交叉表。
    - 执行分位数分析以及其它统计分组分析。

In [ ]:
笔记：对"时间序列"数据的聚合（groupby的特殊用法之一）也称作重采样（resampling），本书将在第11章中单独对其进行讲解。

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [ ]:
@GroupBy机制

In [ ]:
Hadley Wickham（许多热门R语言包的作者）创造了一个用于表示分组运算的术语：
"split-apply-combine"（拆分－应用－合并）

第一个阶段，pandas对象（无论是Series、DataFrame还是其他的）中的数据会根据你所提供的一个或多个键被"拆分（split）"为多组。
拆分操作是在"对象的特定轴"上执行的。
例如，DataFrame可以在其行（axis=0）或列（axis=1）上进行分组。

第二个阶段，将一个函数"应用（apply）"到各个分组并产生一个新值。

第三个阶段，所有这些函数的执行结果会被"合并（combine）"到最终的结果对象中。结果对象的形式一般取决于数据上所执行的操作。

图10-1大致说明了一个简单的分组聚合过程

In [ ]:
"分组键（Each grouping key）"可以有多种形式，且类型不必相同：

    - 列表或数组，其长度与待分组的轴一样。
    - 表示DataFrame某个列名的值。
    - 字典或Series，给出待分组轴上的值与分组名之间的对应关系。
    - 函数，用于处理轴索引或索引中的各个标签。

注意，后三种都只是快捷方式而已，其最终目的仍然是产生一组用于拆分对象的值。
如果觉得这些东西看起来很抽象，不用担心，我将在本章中给出大量有关于此的示例。

In [ ]:
首先来看下面这个非常简单的表格型数据集（以DataFrame的形式）：

In [2]:
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                   'key2':['one', 'two', 'one', 'two', 'one'],
                   'data1':np.random.randn(5),
                   'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.247627 -0.152055
1    a  two  0.289742  1.467815
2    b  one -1.552943  0.777344
3    b  two  1.659534  0.547112
4    a  one  0.910901 -0.789060

In [ ]:
假设你想要按'key1'进行分组，并计算data1列的平均值。
实现该功能的方式有很多，而我们这里要用的是：访问data1，并根据key1调用groupby：

In [3]:
grouped = df['data1'].groupby(df['key1']) # 传入Seires: df['data1']
grouped

In [ ]:
变量grouped是一个GroupBy对象。
它实际上还没有进行任何运算，只是含有一些有关分组键 df['key1'] 的中间数据而已。
换句话说，该对象已经有了接下来对各分组执行运算所需的一切信息。

In [ ]:
例如，我们可以通过调用GroupBy的mean方法来计算分组平均值：

In [4]:
grouped.mean() # 聚合后产生新的Series，分组键（grouping key）key1作为index的name

key1
a    0.816090
b    0.053295
Name: data1, dtype: float64

In [ ]:
稍后我将详细讲解.mean()的调用过程。
这里最重要的是，数据（Series）根据分组键进行了聚合，产生了一个新的Series，其索引为key1列中的唯一值。
之所以结果中索引的名称为key1，是因为原始DataFrame的列df['key1']就叫这个名字。

In [ ]:
如果我们一次传入多个数组的列表，就会得到不同的结果：

In [5]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     1.079264
      two     0.289742
b     one    -1.552943
      two     1.659534
Name: data1, dtype: float64

In [ ]:
这里，我通过两个键对数据进行了分组，得到的Series具有一个层次化索引（hierarchical indexing）
且层次化索引由唯一的"键值对"组成：

In [6]:
means.unstack()

key2       one       two
key1
a     1.079264  0.289742
b    -1.552943  1.659534

In [13]:
Signature: means.unstack(level=-1, fill_value=None)
Docstring:
Unstack, a.k.a. pivot, Series with MultiIndex to produce DataFrame.
The level involved will automatically get sorted.

Parameters
----------
level : int, string, or list of these, default last level(default -1)
    Level(s) to unstack, can pass level name
fill_value : replace NaN with this value if the unstack produces
    missing values
    
Examples
--------
>>> s = pd.Series([1, 2, 3, 4],
...     index=pd.MultiIndex.from_product([['one', 'two'], ['a', 'b']]))
>>> s
one  a    1
     b    2
two  a    3
     b    4
dtype: int64

>>> s.unstack(level=-1)
     a  b
one  1  2
two  3  4

>>> s.unstack(level=0)
   one  two
a    1    3
b    2    4

Returns
-------
unstacked : DataFrame

In [ ]:
在上面这个例子中，分组键均为Series。实际上，分组键可以是任何"长度相同"的数组：

In [7]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [8]:
df['data1'].groupby([states, years]).mean()

California  2005    0.289742
            2006   -1.552943
Ohio        2005    1.453581
            2006    0.910901
Name: data1, dtype: float64

In [9]:
df

  key1 key2     data1     data2
0    a  one  1.247627 -0.152055
1    a  two  0.289742  1.467815
2    b  one -1.552943  0.777344
3    b  two  1.659534  0.547112
4    a  one  0.910901 -0.789060

In [ ]:
通常，分组信息就位于相同的要处理DataFrame中。
这里，你还可以将列名（可以是字符串、数字或其他Python对象）用作分组键：

In [10]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.816090  0.175567
b     0.053295  0.662228

In [11]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   1.079264 -0.470557
     two   0.289742  1.467815
b    one  -1.552943  0.777344
     two   1.659534  0.547112

In [ ]:
你可能已经注意到了，第一个例子在执行df.groupby('key1').mean()时，结果中没有key2列。
这是因为 df['key2'] "不是数值数据"，也被称作"麻烦列（nuisance column）"，所以被从结果中排除了。
默认情况下，所有数值列都会被聚合，虽然有时可能会被过滤为一个子集，稍后就会碰到。

In [ ]:
无论你准备拿groupby做什么，都有可能会用到GroupBy的size方法，它可以返回一个含有分组大小的Series：

In [12]:
# 返回每个分组中元素的个数，即每个层次化索引元组中包含的数据个数
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [ ]:
注意，任何分组关键词中的缺失值，都会被从结果中除去。

In [ ]:
@对分组进行迭代（Iterating over groups）

In [ ]:
这里贴原文：
    The GroupBy object supports iteration, generating a sequence of 2-tuples containing the group name along with the chunk of data.
    GroupBy对象支持迭代，迭代后产生一组由"分组名（group name）"和"数据块（chunk of data）"组成的二元元组。

In [ ]:
看下面的例子：

In [13]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)
    print('\n')

a
  key1 key2     data1     data2
0    a  one  1.247627 -0.152055
1    a  two  0.289742  1.467815
4    a  one  0.910901 -0.789060


b
  key1 key2     data1     data2
2    b  one -1.552943  0.777344
3    b  two  1.659534  0.547112

In [ ]:
对于多重键的情况，元组的第一个元素将会是由键值组成的元组：

In [14]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)
    print('\n')

('a', 'one')
  key1 key2     data1     data2
0    a  one  1.247627 -0.152055
4    a  one  0.910901 -0.789060


('a', 'two')
  key1 key2     data1     data2
1    a  two  0.289742  1.467815


('b', 'one')
  key1 key2     data1     data2
2    b  one -1.552943  0.777344


('b', 'two')
  key1 key2     data1     data2
3    b  two  1.659534  0.547112

In [ ]:
当然，你可以对这些数据片段做任何操作。

In [ ]:
有一个你可能会觉得有用的运算：将这些数据片段做成一个字典：

In [19]:
piece = dict(list(df.groupby('key1')))
piece

{'a':   key1 key2     data1     data2
 0    a  one  1.247627 -0.152055
 1    a  two  0.289742  1.467815
 4    a  one  0.910901 -0.789060, 'b':   key1 key2     data1     data2
 2    b  one -1.552943  0.777344
 3    b  two  1.659534  0.547112}

In [21]:
piece['b']

  key1 key2     data1     data2
2    b  one -1.552943  0.777344
3    b  two  1.659534  0.547112

In [ ]:
groupby默认是在axis=0上进行分组的，通过设置也可以在其他任何轴上进行分组。
拿上面例子中的df来说，我们可以根据dtype对列进行分组：

In [22]:
df

  key1 key2     data1     data2
0    a  one  1.247627 -0.152055
1    a  two  0.289742  1.467815
2    b  one -1.552943  0.777344
3    b  two  1.659534  0.547112
4    a  one  0.910901 -0.789060

In [23]:
# 列的类型：
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [25]:
grouped = df.groupby(df.dtypes, axis=1)
grouped

In [ ]:
可以如下打印分组：

In [27]:
for dtype, group in grouped:
    print(dtype)
    print(group)
    print('\n')

float64
      data1     data2
0  1.247627 -0.152055
1  0.289742  1.467815
2 -1.552943  0.777344
3  1.659534  0.547112
4  0.910901 -0.789060


object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [ ]:
@选取一列或列的子集

In [30]:
df

  key1 key2     data1     data2
0    a  one  1.247627 -0.152055
1    a  two  0.289742  1.467815
2    b  one -1.552943  0.777344
3    b  two  1.659534  0.547112
4    a  one  0.910901 -0.789060

In [ ]:
对于由DataFrame产生的GroupBy对象，如果用一个（单个字符串）或一组（字符串数组）列名对其进行索引，就能实现选取部分列进行聚合的目的。
也就是说：

In [29]:
# 按key1聚合，对data1列运算并以Series形式得到结果，返回SeriesGroupBy对象：
df.groupby('key1')['data1']

# 按key1聚合，对data2列运算并以DataFrame形式得到结果，返回DataFrameGroupBy对象：
df.groupby('key1')[['data2']]

In [ ]:
是以下代码的语法糖：

In [39]:
df['data1'].groupby(df['key1'])
df[['data2']].groupby(df['key2'])

In [ ]:
尤其对于大数据集，很可能只需要对部分列进行聚合。
例如，在前面那个数据集中，如果只需计算data2列的平均值并以DataFrame形式得到结果，可以这样写：

In [40]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.470557
     two   1.467815
b    one   0.777344
     two   0.547112

In [ ]:
如果传入的是标量形式的单个列名，则以Series形式返回：

In [42]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped

In [43]:
s_grouped.mean()

key1  key2
a     one    -0.470557
      two     1.467815
b     one     0.777344
      two     0.547112
Name: data2, dtype: float64

In [ ]:
@通过字典或Series进行分组

In [ ]:
除数组以外，分组信息还可以其他形式存在。来看另一个示例DataFrame：

In [51]:
people = pd.DataFrame(np.random.randn(5, 5), 
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve','Wes','Jim','Travis'])
people

               a         b         c         d         e
Joe     0.559651  0.622502  2.384330  0.494355 -1.706485
Steve   0.073478 -0.786026 -0.475770  0.919876  0.423878
Wes     0.592810 -1.428840 -1.355695 -0.650982 -0.194658
Jim     1.259352 -0.588040 -0.079796  0.311486  1.505261
Travis  0.394074 -0.582358 -1.315370 -0.703210  0.182912

In [53]:
people.iloc[2:3, [1, 2]] = np.nan
people

               a         b         c         d         e
Joe     0.559651  0.622502  2.384330  0.494355 -1.706485
Steve   0.073478 -0.786026 -0.475770  0.919876  0.423878
Wes     0.592810       NaN       NaN -0.650982 -0.194658
Jim     1.259352 -0.588040 -0.079796  0.311486  1.505261
Travis  0.394074 -0.582358 -1.315370 -0.703210  0.182912

In [ ]:
现在，假设已知列的分组关系，并希望根据分组计算列的和：

In [54]:
# 字典作为映射关系
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f': 'orange'}

In [ ]:
现在，你可以将这个字典传给groupby，来构造数组，
但我们可以直接传递字典（我包含了键“f”来强调，存在未使用的分组键是可以的）：

In [56]:
by_column = people.groupby(mapping, axis=1)

In [57]:
by_column.sum()

            blue       red
Joe     2.878685 -0.524333
Steve   0.444106 -0.288670
Wes    -0.650982  0.398152
Jim     0.231690  2.176573
Travis -2.018580 -0.005372

In [ ]:
Series也有同样的功能，它同样可以被看做一个固定大小的映射：

In [58]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [59]:
# 聚合运算时默认省略 NAN 值
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [ ]:
@通过函数进行分组

In [ ]:
比起使用字典或Series，使用Python函数是一种更原生的方法定义分组映射。
任何被当做分组键的函数都会在"各个索引值"上被调用一次，其"返回值"就会被用作"分组名称"。

In [ ]:
具体点说，以上一小节的示例DataFrame为例，其索引值为人的名字。
你可以计算一个字符串长度的数组，更简单的方法是传入len函数：

In [60]:
people.groupby(len).sum()

          a         b         c         d         e
3  2.411813  0.034462  2.304534  0.154859 -0.395882
5  0.073478 -0.786026 -0.475770  0.919876  0.423878
6  0.394074 -0.582358 -1.315370 -0.703210  0.182912

In [ ]:
将函数跟数组、列表、字典、Series混合使用也不是问题，因为任何东西在内部都会被转换为数组：

In [61]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [62]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.559651  0.622502  2.384330 -0.650982 -1.706485
  two  1.259352 -0.588040 -0.079796  0.311486  1.505261
5 one  0.073478 -0.786026 -0.475770  0.919876  0.423878
6 two  0.394074 -0.582358 -1.315370 -0.703210  0.182912

In [ ]:
@根据索引级别分组

In [ ]:
层次化索引数据集最方便的地方就在于它能够根据轴索引的一个级别进行聚合：

In [63]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]],
                                    names=['city', 'tenor'])

In [64]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

city         US                            JP
tenor         1         3         5         1         3
0     -0.161803  1.042377  0.076601  1.326260 -0.152493
1     -0.399821  0.979430  0.453493  0.181507 -1.019781
2      0.673993  1.281674  1.187966  1.380798  2.500274
3     -0.715179  0.274015  0.448095 -0.016566  0.234884

In [ ]:
要根据级别分组，使用level关键字传递级别序号或名字：

In [65]:
hier_df.groupby(level='city', axis=1).count()

city  JP  US
0      2   3
1      2   3
2      2   3
3      2   3

In [ ]:
@ author: melo
@ updated: 2018-10-28